---
title: "mysql_batch_and_fetch"
date: 2018-07-02T19:00:00+02:00
draft: false
tags: [mysql_batch_and_fetch, MySQL]
---

In [ ]:
import warnings; warnings.filterwarnings('ignore')

load the `oxyba` module

In [ ]:
import oxyba as ox

Define the credentials to access the database

In [ ]:
cfg_mysql = {'user': 'anonymous', 'passwd': '', 'host': 'ensembldb.ensembl.org', 'port': 3306}

### All SQL statements in one string

Fetch the data and show the result table as tuple of tuple

In [ ]:
sql_query = "set @x := 12; set @y := 3; select @x * @y, @y * 2.5;"

data = ox.mysql_batch_and_fetch(cfg_mysql, sql_query)
data

Convert to ndarray or dataframe

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.asarray(data))
df

### Queries as array of strings

In [ ]:
sql_query = ["set @x := 12", "set @y := 3", "select @x * @y, @y * 2.5"]
data = ox.mysql_batch_and_fetch(cfg_mysql, sql_query)
data

### Each SQL statement as input argument